[

    {
        "user":"Mikes Mobile",
        "title":"I like your Vineyard Steel Security door but don’t like how it says Welcome. Is there something else that we can get there instead?",
        "slug":"vineyard-steel-security-door-says-welcome",
        "category":"Security Doors",
        "content":[
            "Absolutely! Our Vineyard Steel Security doors can be changed!  At Mike’s Mobile Screen and Chimney Service all of our steel security doors are 100% custom so all you have to do is ask.  We can put another word, a design, your initials or take the middle piece out of the door altogether. Our steel doors are only limited by your imagination."
        ],
        "images":["/assets/images/blogposts/4-8-18/1.png"],
        "postdate":"4/8/18"
    },
    {
        "user":"Mikes Mobile",
        "title":"Another Custom Creation: Custom Security Doors",
        "slug":"another-custom-creation",
        "category":"Hayward",
        "content":[
            "Sometimes customers are not sure what they want and sometimes they know exactly what they want! Joe from San Jose knew exactly what he wanted when he came to us. He needed French style custom security doors that SLIDE! Sliding security doors are not very common, but as you can see, they are beautiful. We worked with Joe and created a masterpiece! He picked out the Sunburst pattern that goes perfect with double doors. The white on white color keeps his home elegant.",

            "We love working with our customers to create working art for their home. Please give us a call today! (877) 520-3595 Check out the gallery below to see more pictures from this beautiful home."
        ],
        "images":["/assets/images/blogposts/4-9-18/1.jpg"],
        "postdate":"4/9/18"
    },
    {
        "user":"Mikes Mobile",
        "title":"Why Solar Screens beat the heat better than anything else.",
        "slug":"solar-screens-beat-heat-better-anything-else",
        "category":"Solar Screens",
        "content":[
            "The simple answer is that Solar Screens stop the sun’s rays before they ever have a chance to reach your window. In contrast, window tint goes on the inside of the window, actually working against nicer insulated windows (some window tinting can actually void warranties on dual or triple paned windows due to the overheating possibilities). The same goes for all blinds and interior window coverings. Your window will still heat up and radiant heat will still heat up your home. Solar Screens work with your windows to keep the heat out and act as another insulation barrier making your home more efficient, more comfortable and saving you money. Mike’s Mobile Screens offers the highest quality Solar Screen materials available that block 80-90% of the sun’s UV rays."
        ],
        "images":["/assets/images/blogposts/4-10-18/1.jpg"],
        "postdate":"4/10/18"
    },
    {
        "user":"Mikes Mobile",
        "title":"Another Paradise Set in Rodeo",
        "slug":"another-paradise-set-in-rodeo",
        "category":"Hayward",
        "content":[
            "Jackie C. from Rodeo called in about a custom security solution for her home.  Here at Mike’s Mobile we were of course happy to oblige to this request! Jackie chose our Paradise design french steel security door set in a red powder coat and white mesh to match her existing door & trim. We even added a custom mail slot to fit her needs.",

            "Our Steel Security Doors are completely custom to fit whatever door style, mounting style & color combination go best with your home. Every steel security door can have custom 2 tone colors at no extra charge. Click here to view our available colors.",

            "To get a custom steel security door today give us a call at (877) 520-3595",

            "For more information on our custom steel security doors, visit our website: Mike’s Mobile – Steel Security Doors"
        ],
        "images":["/assets/images/blogposts/4-11-18/1.png","/assets/images/blogposts/4-11-18/2.png"],
        "postdate":"4/11/18"
    },
    {
        "user":"Mikes Mobile",
        "title":"Another Custom Creation! Custom Security Doors",
        "slug":"another-custom-creation-custom-security-doors",
        "category":"Hayward",
        "content":[
            "Sometimes customers are not sure what they want and sometimes they know exactly what they want! Joe from San Jose knew exactly what he wanted when he came to us. He needed French style custom security doors that SLIDE! Sliding security doors are not very common, but as you can see, they are beautiful. We worked with Joe and created a masterpiece! He picked out the Sunburst pattern that goes perfect with double doors. The white on white color keeps his home elegant. We love working with our customers to create working art for their home. Please give us a call today! (877) 520-3595 Check out the gallery below to see more pictures from this beautiful home."
        ],
        "images":["/assets/images/blogposts/6-14/another-custom-creation-custom-security-doors.jpeg"],
        "postdate":"6/24/14"
    },
    {
        "user":"Mikes Mobile",
        "title":"Napa and Vallejo Masonry Repair",
        "slug":"napa-vallejo-masonry-repair",
        "category":["Hayward"],
        "content":[
            "Mike’s Mobile Screen & Chimney Service is a full service Chimney Sweep and Chimney Repair company in the Napa and Vallejo area, but did you also know that we do masonry repair that is not chimney related? We have technicians in your area that have been rebuilding structures since the Earthquake that shook this area on August 24th 2014. Napa and Vallejo area residents can rest easy knowing that Mike’s Mobile Screen & Chimney Service are on the job. Our trained technicians know how to navigate through the permit system, yellow tags, red tags and inspections. We offer free inspections/estimates to all of our customers with Earthquake damage. Take a second and look at some Masonry work that is not chimney related!"
        ],
        "images":["/assets/images/blogposts/10-14/napa-vallejo-masonry-repair.jpg"],
        "postdate":"10/2/14"
    },
    {
        "user":"Mikes Mobile",
        "title":"Napa and Vallejo areas, Yellow and Red Tags Explained",
        "slug":"napa-vallejo-areas-yellow-and-red-tags-explained",
        "category":["Hayward"],
        "content":[
            "Mike's Mobile Screen & Chimney Service is helping the people of Napa and Vallejo areas navigate their way through the process of City inspections, yellow tags and red tags. This blog is to tell you all about the process and explain everything. City Inspections: Mike's Mobile has a California State Contractor's License with the CSLB. Our technicians will easily navigate through this process and get a Permit for your home and the work to be done. City Inspectors come to inspect the work at key points in the Demolition/Construction. Once the work is complete there will be a final inspection. At this time the city will remove the color coded tag from you door. Yellow Tag A yellow tag means “cautionary.” Property owners can access and clean their buildings, and once clean can contact the City for re-inspection. Call 707-258-7829 to request a re-inspection. Red Tag A red tag means the building structure has been damaged and is not safe to enter. Please do not enter your building. You must hire a qualified, licensed engineer to inspect the property and prepare a written assessment. The City will post a list of qualified engineers from the region on its website at www.cityofnapa.org, or you may already have one to work with. Submit the assessment report to the City’s Building Department at 1600 First Street, beginning Tuesday, August 26th. If the report indicates the building is safe to access and occupy, the City will upgrade the red tag to a yellow tag, and then you must follow the steps described above for a yellow tag. If the report indicates the building is not safe to access and occupy, the report will include recommendations for structural modifications. The Building Division will work with the owner on the best course of action."
        ],
        "images":["/assets/images/blogposts/10-14/napa-vallejo-areas-yellow-and-red-tags-explained.jpg"],
        "postdate":"10/3/14"
    },
    {
        "user":"Mikes Mobile",
        "title":"Tru-View Doors in Brentwood",
        "slug":"tru-view-doors-in-brentwood",
        "category":["Hayward"],
        "content":[
            "Check out our Tru-View security screen door that was installed in Brentwood! The Tru-View door is the younger brother of the Viewguard security screen door. These doors are great for back yard porches and even front doors! Our customer, Sharon B., from Brentwood, picked out Tru-View doors for her front door and back door! Since her home had one color scheme in the front and another in the back, she picked out a bronze Tru-View for the front and a white one for the back. Thanks Sharon! We all think her doors look awesome and now you can be the judge. Is a Tru-View right for you? If you’re in Brentwood call us today at (925) 443-0700, if you’re somewhere else call us toll free, at (877) 520-3595 and get yours ordered!"
        ],
        "images":["/assets/images/blogposts/5-15/front-door-tru-view.png","/assets/images/blogposts/5-15/front-door-tru-view-white.png"],
        "postdate":"5/15/15"
    },
    {
        "user":"Mikes Mobile",
        "title":"Best Chimney Sweep in Hayward",
        "slug":"best-chimney-sweep-in-hayward",
        "category":["Hayward"],
        "content":[
            "As with anything in this world, you generally get what you pay for. When it comes to your home, it never pays to cut corners, especially when dealing with fire, literally. To find the best chimney sweep in Hayward, you must do your research. Always use a company that is licensed, bonded and insured. If you are not sure just ask! Mike's Mobile Screen & Chimney Service holds multiple licenses by the Contractor’s State License Board of California and carries a current bond and is fully insured for your protection. We use the strict standards of the CSIA and are NFI certified. This makes Mike's Mobile Screen & Chimney Service the best chimney service to do work on your chimney. With every chimney sweep, we include a full, written, Level 1 Inspection report. We are a full service chimney company that can handle the simplest of repairs to full rebuilds. Some of the repairs we handle on a daily basis include: Crown repair, heat damage to the firebox wall, replacing the chimney liner, replacing refractory panels, de-glazing and more! For more details and services visit us online at mikesmobile.com or call us today! You can reach us at (510) 277-5694 or (925) 443-0700"
        ],
        "images":["/assets/images/blogposts/9-15/Licensed-Insured-Bonded-Badge.png","/assets/images/blogposts/9-15/sacramento-chimney.jpg"],
        "postdate":"9/15/15"
    },
    {
        "user":"Mikes Mobile",
        "title":"Another Paradise Set in Rodeo",
        "slug":"another-paradise-set-in-rodeo",
        "category":["Hayward"],
        "content":[
            "Jackie C. from Rodeo called in about a custom security solution for her home. Here at Mike’s Mobile we were of course happy to oblige to this request! Jackie chose our Paradise design french steel security door set in a red powder coat and white mesh to match her existing door & trim. We even added a custom mail slot to fit her needs. Our Steel Security Doors are completely custom to fit whatever door style, mounting style & color combination go best with your home. Every steel security door can have custom 2 tone colors at no extra charge. Click here to view our available colors. To get a custom steel security door today give us a call at (877) 520-3595 For more information on our custom steel security doors, visit our website: Mike's Mobile - Steel Security Doors"
        ],
        "images":["/assets/images/blogposts/11-15/steel-security-red-door.png","/assets/images/blogposts/11-15/steel-security-red-door.png"],
        "postdate":"11/13/15"
    },
    {
        "user":"Mikes Mobile",
        "title":"How To Keep Bugs Away From Your Screen",
        "slug":"keep-bugs-away-screen",
        "category":["Window Screens"],
        "content":[
            "Those long hot summer days are finally here and so are the annoying bugs that come with them. Here are some quick tips how to keep those pesky bugs away from your screens: Clean Your Screens Debris is constantly flying through the air and getting caught in your window screens. This collection of small particles can attract several types of bugs causing them to hang out onto your screens. Simply remove your window screens and wash them with a mild soap and water. This is a great time to wash your windows also. Not feeling up to it? Give us a call and we can wash your windows inside and out! Be sure to let the screens dry before re-installing to avoid spotting your windows. Household Repellents If washing the screens doesn't seem to help you there are some simple repellents you might find around the home that can be used to deter bugs. A little bit of peppermint oil on your screens usually works. It can be applied easily using a paper towel. Vinegar works well as a second choice. Ammonia works great as a cat and small animal repellent. Citronella Citronella is a popular bug repellent and comes in an oil form or in candles. You can often find it at outdoor stores near camping equipment. Now you can enjoy your summer breezes without unsightly bugs crawling all over your screens!"
        ],
        "images":["/assets/images/blogposts/8-17/how-to-keep-bugs-away.jpg"],
        "postdate":"8/16/17"
    },
    {
        "user":"Mikes Mobile",
        "title":"I like your Vineyard Steel Security door but don’t like how it says Welcome.  Is there something else that we can get there instead?",
        "slug":"vineyard-steel-security-door-says-welcome",
        "category":["Security Doors"],
        "content":[
            "Absolutely! Our Vineyard Steel Security doors can be changed! At Mike’s Mobile Screen and Chimney Service all of our steel security doors are 100% custom so all you have to do is ask. We can put another word, a design, your initials or take the middle piece out of the door altogether. Our steel doors are only limited by your imagination."
        ],
        "images":["/assets/images/blogposts/8-17/vinyard-security-door.jpg"],
        "postdate":"8/23/17"
    },
    {
        "user":"Mikes Mobile",
        "title":"Is it a good idea to get grids over my Solar Screens?",
        "slug":"grids-over-solar-screens",
        "category":["Solar Screens"],
        "content":[
            "Sure! Solar Screens with grids are a great way to spruce up the look of your home. One thing to note, however, is if your home already has windows with grids and you have us install Solar Screens with grids then your windows may look busy from the inside looking out. From some angles you may see both sets of grids. If you don’t want a grid pattern we would recommend at least one bar going across the middle (we call it a spreader bar) that matches the separation in the middle of your window."
        ],
        "images":["/assets/images/blogposts/8-17/solar-screens-with-grids.jpg"],
        "postdate":"8/25/17"
    },
    {
        "user":"Mikes Mobile",
        "title":"How do I measure screens to get a quote over the phone?",
        "slug":"measure-solar-screens",
        "category":["Solar Screens"],
        "content":[
            "Easy! If you need bugscreens or re-screens just count them and call. We charge flat rates to make things simple for you. If you are interested in a quote for Solar Screens you can measure the width and height of each window you are interested in (keep in mind Solar Screens generally cover the entire window). You can measure from the inside or the outside and just round to the nearest foot. Or call Mike’s Mobile Screen and Chimney Service today at 1-877-520-3595 and we can come out to measure your windows for you and give you a FREE in-home estimate!"
        ],
        "images":["/assets/images/blogposts/8-17/Solar-Screen-door-installation.jpg"],
        "postdate":"8/27/17"
    },
    {
        "user":"Mikes Mobile",
        "title":"Are there screens that work with doors that open outward (outswing doors)?",
        "slug":"screen-doors-outswing-doors",
        "category":["Screen Doors"],
        "content":[
            "Sure! Our disappearing screen doors are the perfect option to fit on outswing doors. Our Rollaway brand disappearing screen doors mount inside the door frame. Other brands of disappearing screen doors are surface mount and protrude into your home. With our inside mounting and color matching all the way around these, doors are hardly noticeable when not in use."
        ],
        "images":["/assets/images/blogposts/8-17/double-door-screen-doors.jpg"],
        "postdate":"8/28/17"
    },
    {
        "user":"Mikes Mobile",
        "title":"How Long Do Solar Screens Last?",
        "slug":"long-solar-screens-last",
        "category":["Solar Screens"],
        "content":[
            "Can Solar Screens last longer than any other part of your home? Absolutely! Mike’s Mobile uses the highest quality materials, and has the best Solar Screen warranty in the industry - 10 years!  We recommend to keep your solar screens looking nice that they be cleaned 1-2 times a year with a mild soap/water solution. Feeling like pampering yourself? Call Mike’s Mobile today and we can take care of washing your Solar Screens as well as your windows!"
        ],
        "images":["/assets/images/blogposts/8-17/cleaning-Solar-Screens.jpg"],
        "postdate":"8/29/17"
    },
    {
        "user":"Mikes Mobile",
        "title":"I want a security door, but I don’t want my house to look like it has jail bars.  What options do I have?",
        "slug":"want-security-door-dont-want-house-look-like-jail-bars-options",
        "category":["Security Doors"],
        "content":[
            "Our Aluminum security doors are made specifically to address your security needs without having the “jail bar” look most security doors are known for. The Tru-View and Viewguard have a unique stainless mesh (painted black) that offers security at its highest level without unsightly bars. If those doors aren't what you are looking for we have steel security door options that can blow away our competition. Check out our Vino Welcome (Vineyard) steel security door in two-tone colors."
        ],
        "images":["/assets/images/blogposts/8-17/viewgaurd-install.jpg"],
        "postdate":"8/30/17"
    },
    {
        "user":"Mikes Mobile",
        "title":"The steel security doors I’ve seen have big gaps and let in bugs. Is there anything you can do to prevent this?",
        "slug":"steel-security-doors-ive-seen-big-gaps-let-bugs-anything-can-prevent",
        "category":["Security Doors"],
        "content":[
            "Glad you asked! The steel security doors you are thinking of are the kind sold by our competition, and are usually a 3 piece design. A 3 piece door is going to have large gaps at the top, sides and usually the bottom. They have the doors made this way so they will fit a wider variety of door frames. At Mike’s Mobile Screens & Chimney Service our steel doors are 100% custom and made to fit your home. We build our doors in a, far superior, 1 piece design for added strength and beauty. We have over 10 different mounting styles so no matter what kind of existing door frame you have we can build something to fit perfectly. We also build every steel door to stop the bugs from coming in, as well as unwanted people. We have built in flanges that cover all the gaps (as well as adding more security) and can put a door sweep on the bottom to complete the installation."
        ],
        "images":["/assets/images/blogposts/8-17/gap-door-versus.jpg"],
        "postdate":"8/31/17"
    }

]